#include <REGX52.H>
#include "my_interrupt.h"

void Interrupt_Init(void) {
	
	// ===== 定时器 T0 配置 =====
	TMOD &= 0xF0;		//设置定时器模式
	TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x00;		//设置定时初值
	TH0 = 0xB8;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	ET0 = 1;
	
    // ===== 定时器 T2 配置 =====
	T2MOD = 0;		//初始化模式寄存器
	T2CON = 0;		//初始化控制寄存器
	TL2 = 0x8F;		//设置定时初值
	TH2 = 0xFE;		//设置定时初值
	RCAP2L = 0x8F;		//设置定时重载值
	RCAP2H = 0xFE;		//设置定时重载值
	TR2 = 0;		//定时器2不开始计时
	
    ET2 = 1;            // 允许T2中断	
    // ===== 外部中断 INT1 配置（下降沿触发）=====
    IT1 = 1;            // 设置 INT1 为下降沿触发
    EX1 = 1;            // 允许外部中断 INT1

    // ===== 中断优先级配置 =====
    PT2 = 1;            // 定时器2设为高优先级
	PT0 = 0;			// 定时器0设为普通优先级
    PX1 = 1;            // INT1设为高优先级
    EA  = 1;            // 开启总中断
}

